/*------------------------------------------------------------------------------
*	Guide:	01-KERNEL
*	File:	ex01 / kernel / kernel.c
*	Title:	Ядро
* ------------------------------------------------------------------------------
*	Description:
* ----------------------------------------------------------------------------*/


#include "../common.h"
#include "../drivers/screen.h"


s32		kmain()
{	
	/* Простая программа чтобы продемонстрировать чего мы добились. */
	/* Поиграйтесь с кодом и добавьте больше логики, попробуйте заполнить все */
	/* 25 строк чтобы посмотреть работу функции scroll_line. */

	u8 i;
	
	clear_screen();

	i = 0;
	while (i < 3)
	{
		kprint("Hello, world!\n");
		i++;
	}

	return 0;
}
